; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v12)
             (pred_1 ?v7 ?v6)
             (pred_5 ?v2 ?v6)
             (pred_6 ?v3 ?v2 )
	     (pred_3 ?v2)
             (pred_11 ?v11)
             (pred_12 ?v7)
             (pred_7 ?v6)
             (pred_9 ?v2)
             (pred_2 ?v7)
             (pred_10 ?v2)
             (pred_8 ))



(:action op_2
:parameters (?v5 ?v13 ?v8 ?v10)
:precondition (and (pred_11 ?v5) (pred_11 ?v13) (pred_12 ?v8) (pred_7 ?v10)
          (pred_4 ?v5 ?v13) (pred_1 ?v8 ?v10)
                   (pred_5 ?v13 ?v10) (pred_3 ?v5) 
                   (pred_9 ?v13) (pred_2 ?v8))
:effect (and  (pred_10 ?v13) (not (pred_9 ?v13))))


(:action op_1
:parameters (?v5 ?v4)
:precondition (and (pred_11 ?v5) (pred_11 ?v4)
               (pred_3 ?v5) (pred_4 ?v5 ?v4) (pred_10 ?v4))
:effect (and (pred_3 ?v4) (not (pred_3 ?v5))))

(:action op_4
:parameters (?v5 ?v8)
:precondition (and (pred_11 ?v5) (pred_12 ?v8) 
                  (pred_3 ?v5) (pred_6 ?v8 ?v5) (pred_8 ))
:effect (and (pred_2 ?v8)
   (not (pred_6 ?v8 ?v5)) (not (pred_8 ))))


(:action op_3
:parameters (?v5 ?v1 ?v9)
:precondition (and (pred_11 ?v5) (pred_12 ?v1) (pred_12 ?v9)
                  (pred_3 ?v5) (pred_2 ?v9) (pred_6 ?v1 ?v5))
:effect (and (pred_2 ?v1) (pred_6 ?v9 ?v5)
        (not (pred_2 ?v9)) (not (pred_6 ?v1 ?v5))))

(:action op_5
:parameters (?v5 ?v8)
:precondition (and (pred_11 ?v5) (pred_12 ?v8) 
                  (pred_3 ?v5) (pred_2 ?v8))
:effect (and (pred_8 ) (pred_6 ?v8 ?v5) (not (pred_2 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_09 obj_28 obj_10 obj_23 obj_05 obj_07 obj_04 obj_26 obj_21 obj_27 obj_29 obj_31 obj_20 obj_06 obj_17 obj_30 obj_24 obj_14 obj_15 obj_13 obj_12 obj_08 obj_01 obj_22
    obj_18 obj_03 obj_25
    obj_11 obj_02 obj_16
    )

    (:init
       (pred_8)

       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_11 obj_28)
       (pred_11 obj_10)
       (pred_11 obj_23)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_04)
       (pred_11 obj_26)
       (pred_11 obj_21)
       (pred_11 obj_27)
       (pred_11 obj_29)
       (pred_11 obj_31)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_17)
       (pred_11 obj_30)
       (pred_11 obj_24)
       (pred_11 obj_14)
       (pred_11 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_12)
       (pred_11 obj_08)
       (pred_11 obj_01)
       (pred_11 obj_22)
       (pred_7 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_25)
       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_12 obj_16)

       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_09)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_09 obj_28)
       (pred_4 obj_09 obj_19)
       (pred_4 obj_28 obj_04)
       (pred_4 obj_28 obj_10)
       (pred_4 obj_28 obj_09)
       (pred_4 obj_10 obj_26)
       (pred_4 obj_10 obj_23)
       (pred_4 obj_10 obj_28)
       (pred_4 obj_23 obj_21)
       (pred_4 obj_23 obj_10)
       (pred_4 obj_05 obj_27)
       (pred_4 obj_05 obj_07)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_07 obj_29)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_07 obj_05)
       (pred_4 obj_04 obj_31)
       (pred_4 obj_04 obj_26)
       (pred_4 obj_04 obj_28)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_26 obj_20)
       (pred_4 obj_26 obj_21)
       (pred_4 obj_26 obj_10)
       (pred_4 obj_26 obj_04)
       (pred_4 obj_21 obj_06)
       (pred_4 obj_21 obj_23)
       (pred_4 obj_21 obj_26)
       (pred_4 obj_27 obj_17)
       (pred_4 obj_27 obj_29)
       (pred_4 obj_27 obj_05)
       (pred_4 obj_29 obj_30)
       (pred_4 obj_29 obj_31)
       (pred_4 obj_29 obj_07)
       (pred_4 obj_29 obj_27)
       (pred_4 obj_31 obj_24)
       (pred_4 obj_31 obj_20)
       (pred_4 obj_31 obj_04)
       (pred_4 obj_31 obj_29)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_20 obj_06)
       (pred_4 obj_20 obj_26)
       (pred_4 obj_20 obj_31)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_21)
       (pred_4 obj_06 obj_20)
       (pred_4 obj_17 obj_13)
       (pred_4 obj_17 obj_30)
       (pred_4 obj_17 obj_27)
       (pred_4 obj_30 obj_12)
       (pred_4 obj_30 obj_24)
       (pred_4 obj_30 obj_29)
       (pred_4 obj_30 obj_17)
       (pred_4 obj_24 obj_08)
       (pred_4 obj_24 obj_14)
       (pred_4 obj_24 obj_31)
       (pred_4 obj_24 obj_30)
       (pred_4 obj_14 obj_01)
       (pred_4 obj_14 obj_15)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_24)
       (pred_4 obj_15 obj_22)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_15 obj_14)
       (pred_4 obj_13 obj_12)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_12 obj_08)
       (pred_4 obj_12 obj_30)
       (pred_4 obj_12 obj_13)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_24)
       (pred_4 obj_08 obj_12)
       (pred_4 obj_01 obj_22)
       (pred_4 obj_01 obj_14)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_22 obj_15)
       (pred_4 obj_22 obj_01)
       (pred_9 obj_12)
       (pred_9 obj_06)
       (pred_9 obj_09)
       (pred_5  obj_12 obj_18)
       (pred_5  obj_06 obj_03)
       (pred_5  obj_09 obj_25)
       (pred_10 obj_19)
       (pred_10 obj_28)
       (pred_10 obj_10)
       (pred_10 obj_23)
       (pred_10 obj_05)
       (pred_10 obj_07)
       (pred_10 obj_04)
       (pred_10 obj_26)
       (pred_10 obj_21)
       (pred_10 obj_27)
       (pred_10 obj_29)
       (pred_10 obj_31)
       (pred_10 obj_20)
       (pred_10 obj_17)
       (pred_10 obj_30)
       (pred_10 obj_24)
       (pred_10 obj_14)
       (pred_10 obj_15)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_01)
       (pred_10 obj_22)

       (pred_1  obj_11 obj_18)
       (pred_1  obj_02 obj_03)
       (pred_1  obj_16 obj_25)
       (pred_6 obj_11 obj_08)
       (pred_6 obj_02 obj_24)
       (pred_6 obj_16 obj_26)
       (pred_3 obj_29)
    )

    (:goal (and
       (pred_6 obj_11 obj_27)
       (pred_6 obj_16 obj_30)
    ))
(:constraints
  (always (not (pred_3 obj_04)))
)
)

; plan
1. (op_1 obj_29 obj_31)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_31)
   goals met: 0 of 2
2. (op_1 obj_31 obj_24)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_24)
   goals met: 0 of 2
3. (op_1 obj_24 obj_08)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_08)
   goals met: 0 of 2
4. (op_4 obj_08 obj_11)
   deleted: (pred_6 obj_11 obj_08) (pred_8)
   added: (pred_2 obj_11)
   goals met: 0 of 2
5. (op_1 obj_08 obj_24)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_24)
   goals met: 0 of 2
6. (op_1 obj_24 obj_30)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_30)
   goals met: 0 of 2
7. (op_1 obj_30 obj_29)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_29)
   goals met: 0 of 2
8. (op_1 obj_29 obj_27)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_27)
   goals met: 0 of 2
9. (op_5 obj_27 obj_11)
   deleted: (pred_2 obj_11)
   added: (pred_8) (pred_6 obj_11 obj_27)
   goals met: 1 of 2
10. (op_1 obj_27 obj_29)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_29)
   goals met: 1 of 2
11. (op_1 obj_29 obj_31)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_31)
   goals met: 1 of 2
12. (op_1 obj_31 obj_20)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_20)
   goals met: 1 of 2
13. (op_1 obj_20 obj_26)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_26)
   goals met: 1 of 2
14. (op_4 obj_26 obj_16)
   deleted: (pred_6 obj_16 obj_26) (pred_8)
   added: (pred_2 obj_16)
   goals met: 1 of 2
15. (op_1 obj_26 obj_20)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_20)
   goals met: 1 of 2
16. (op_1 obj_20 obj_31)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_31)
   goals met: 1 of 2
17. (op_1 obj_31 obj_29)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_29)
   goals met: 1 of 2
18. (op_1 obj_29 obj_30)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_30)
   goals met: 1 of 2
19. (op_5 obj_30 obj_16)
   deleted: (pred_2 obj_16)
   added: (pred_8) (pred_6 obj_16 obj_30)
   goals met: 2 of 2
